uhnp/src/Catalogs/ПараметрыРасчетаРезервовПоДЗ/ПараметрыРасчетаРезервовПоДЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПараметрыРасчетаРезервовПоДЗ</name>
  <predefined>
    <items>
      <name>КлассНадежностиКонтрагента</name>
      <description>Класс надежности контрагента</description>
    </items>
    <items>
      <name>КоэффициентСрокаПогашения</name>
      <description>Коэффициент срока погашения</description>
    </items>
  </predefined>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Алгоритм</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПараметраРасчетаРезервов</name>
    <type>
      <types>EnumRef.ТипыПараметровРасчетаРезерва</types>
    </type>
  </attributes>
</mdclass:Catalog>

uhnp/src/InformationRegisters/ПризнакиЗадолженности/ПризнакиЗадолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПризнакиЗадолженности</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ГруппаПризнака</name>
    <type>
      <types>CatalogRef.ГруппыПараметровРасчетаРезервов</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПараметрРасчетаРезервов</name>
    <type>
      <types>CatalogRef.ПараметрыРасчетаРезервовПоДЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/ПараметрыРасчетаРезервовПоДЗ/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипПараметраРасчетаРезерва = Объект.ТипПараметраРасчетаРезервов;
	
	ТипыПараметровРасчетаРезервов = МСФОВызовСервераУХ.ПолучитьСтруктуруСоЗначениямиПеречисления("ТипыПараметровРасчетаРезерва");
	КэшируемыеЗначения = Новый ФиксированнаяСтруктура("ТипыПараметровРасчетаРезервов", ТипыПараметровРасчетаРезервов);
	
	ОбновитьВидимостьСтраниц(ЭтаФорма);
	ОбновитьОтборы();
	
	Если Объект.Предопределенный Тогда
	
		Элементы.Алгоритм.ТолькоПросмотр = Истина;
		Элементы.ТипПараметраРасчетаРезерва.ТолькоПросмотр = Истина;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновленыПризнакиРезервов" Тогда
	    Элементы.ПериодическиеПризнаки.Обновить();	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура ТипПризнакаРезерваПриИзменении(Элемент)
	
	Объект.ТипПараметраРасчетаРезервов = ТипПараметраРасчетаРезерва;
	Модифицированность = Истина;
	
	ОбновитьВидимостьСтраниц(ЭтаФорма);
	ОбновитьОтборы();

КонецПроцедуры

&НаКлиенте
Процедура ГрупповоеДобавление(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Перед изменением групп признаков необходимо записать объект!'"), 20);
		Возврат;
		
	КонецЕсли;
				
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ПараметрРасчетаРезервов", 	Объект.Ссылка);  
	ПараметрыОткрытия.Вставить("Период", 					НачалоМесяца(ТекущаяДата()));
	
	ОткрытьФорму("РегистрСведений.ПризнакиЗадолженности.Форма.ГрупповаяУстановкаПризнаковОбъектов", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПризнаковПередНачаломИзменения(Элемент, Отказ)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Отказ = Истина;
		ПоказатьПредупреждение(, НСтр("ru = 'Перед изменением групп признаков необходимо записать объект!'"), 20);		
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура АлгоритмНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриЗавершенииРедактированияФормулы", ЭтотОбъект);
	ПараметрыФормулы = ПараметрыФормулы(Объект.Алгоритм, УникальныйИдентификатор);		
	КонструкторФормулКлиент.НачатьРедактированиеФормулы(ПараметрыФормулы, ОписаниеОповещения);

КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьВидимостьСтраниц(ЭтаФорма)

	Если ЭтаФорма.Объект.ТипПараметраРасчетаРезервов = ЭтаФорма.КэшируемыеЗначения.ТипыПараметровРасчетаРезервов.Вычисляемый Тогда
	 
		ЭтаФорма.Элементы.СтраницаФормулаРасчета.Видимость = Истина;
		ЭтаФорма.Элементы.СтраницаПериодическиеПризнаки.Видимость = Ложь;
		
	Иначе
				
		ЭтаФорма.Элементы.СтраницаФормулаРасчета.Видимость = Ложь;
		ЭтаФорма.Элементы.СтраницаПериодическиеПризнаки.Видимость = Истина;		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтборы()
	
	Если Объект.ТипПараметраРасчетаРезервов = КэшируемыеЗначения.ТипыПараметровРасчетаРезервов.Вычисляемый Тогда
		ТиповыеОтчетыУХ.ДобавитьОтбор(ГруппыПризнаков.КомпоновщикНастроек, "Владелец", Объект.Ссылка);
	Иначе 
		ТиповыеОтчетыУХ.ДобавитьОтбор(ПериодическиеПризнаки.КомпоновщикНастроек, "ПараметрРасчетаРезервов", Объект.Ссылка);
	КонецЕсли;
			
КонецПроцедуры

#Область КонструкторФормул

&НаСервереБезКонтекста
Функция ПараметрыФормулы(Алгоритм, ФормаИД)
	
	ПараметрыФормулы = КонструкторФормул.ПараметрыРедактированияФормулы();
	
	ПараметрыФормулы.Наименование		= НСтр("ru = 'Формула расчета для <РасчетноеЗначение>'");
	ПараметрыФормулы.СкобкиОперандов 	= Ложь;
	ПараметрыФормулы.Операнды 			= ПоместитьВоВременноеХранилище(ОперандыФормулы(), ФормаИД);
	ПараметрыФормулы.Операторы 			= ПоместитьВоВременноеХранилище(ОператорыФормулы(), ФормаИД);
	
	ПараметрыФормулы.Формула 			= ФормулаДляКонструктора(Алгоритм);
	ПараметрыФормулы.Формула 			= КонструкторФормул.ПредставлениеФормулы(ПараметрыФормулы);
	
	Возврат ПараметрыФормулы;

КонецФункции

&НаСервереБезКонтекста
Функция ФормулаДляКонструктора(Алгоритм)

	Формула = СокрЛП(СтрЗаменить(Алгоритм, "РасчетноеЗначение", ""));//убираем РасчетноеЗначение
	Если СтрНачинаетсяС(Формула, "=") Тогда
		Формула = Сред(Формула, 2);// убираем начальное "="
	КонецЕсли;
	
	Если СтрЗаканчиваетсяНа(Формула, ";") Тогда
		Формула = Сред(Формула, 1, СтрДлина(Формула)-1);// убираем конечную ";"
	КонецЕсли;
	
	Возврат СтрЗаменить(Формула, "СтрокаДокументаРезерв.", "СтрокаДокументаРезерв_");
	
КонецФункции

&НаСервереБезКонтекста
Функция ОперандыФормулы()

	ОперандыФормулы = КонструкторФормул.ДеревоПолей();
	
	ОперандГруппа = ОперандыФормулы.Строки.Добавить();
	ОперандГруппа.Идентификатор 	= "СтрокаДокументаРезерв";
	ОперандГруппа.Представление 	= НСтр("ru = 'Строка документа'");
	ОперандГруппа.Таблица			= Истина;
	//ОперандГруппа.ТипЗначения 		= Новый ОписаниеТипов("ТаблицаЗначений");//ДокументТабличнаяЧасть.РезервыПоДЗИАвансамВыданным.Резервы
	
	ДокументМД = Метаданные.Документы.РезервыПоДЗИАвансамВыданным;
	Для каждого РеквизитТЧ Из ДокументМД.ТабличныеЧасти.Резервы.Реквизиты Цикл
		
		Если РеквизитТЧ.Имя = "КлючСвязи" Тогда
			Продолжить;
		КонецЕсли;
		
		Операнд = ОперандГруппа.Строки.Добавить();
		Операнд.Идентификатор 	= "СтрокаДокументаРезерв_" + РеквизитТЧ.Имя;
		Операнд.Представление 	= РеквизитТЧ.Синоним;
		Операнд.ТипЗначения 	= РеквизитТЧ.Тип;
	
	КонецЦикла;
	
	Возврат ОперандыФормулы;
 
КонецФункции

&НаСервереБезКонтекста
Функция ОператорыФормулы()
	
	ОператорыФормулы = КонструкторФормул.СписокОператоров(
	"Операторы, ЧисловыеФункции, ЛогическиеОператорыИКонстанты, ПрочиеФункции");
	
	Группа = ОператорыФормулы.Строки.Добавить();
	Группа.Идентификатор	= "ФункцииРасчетаРезерва";
	Группа.Представление	= НСтр("ru = 'Функции расчета резерва'");
	Группа.Порядок			= 10;
	Группа.Картинка			= БиблиотекаКартинок.ТипФункция;

	ФункцииУХ = Новый СписокЗначений;
	ФункцииУХ.Добавить("ПолучитьДатуОкончанияОтсрочки", 	НСтр("ru = 'Получить дату окончания отсрочки'"), Истина);
	ФункцииУХ.Добавить("ПолучитьКоличествоДнейПросрочки", 	НСтр("ru = 'Получить количество дней просрочки'"));
	ФункцииУХ.Добавить("ПолучитьДолюПросрочки", 			НСтр("ru = 'Получить долю просрочки'"));
	ФункцииУХ.Добавить("ПолучитьКоэффициентРезерва", 		НСтр("ru = 'Получить коэффициент резерва'"));
		
	Для каждого ФункцияУХ Из ФункцииУХ Цикл
	
		Оператор = Группа.Строки.Добавить();
		Оператор.Идентификатор = ФункцияУХ.Значение;
		Оператор.Представление = ФункцияУХ.Значение + "([Строка документа резерв])";
		Оператор.ТипЗначения = ?(ФункцияУХ.Пометка, Новый ОписаниеТипов("Дата"), Новый ОписаниеТипов("Число"));
		Оператор.Картинка = БиблиотекаКартинок.Пустая;//БиблиотекаКартинок.Пустая;
		Оператор.ЭтоФункция = Истина;
		Оператор.ВыражениеДляВставки = СтрШаблон("ОбработкаТабличныхЧастейКлиентСерверУХ.%1([Строка документа резерв])", ФункцияУХ.Значение);
		//Оператор.Скрытый = Скрытый;
	
	КонецЦикла;
	
	Возврат ОператорыФормулы;
 
КонецФункции

&НаКлиенте
Процедура ПриЗавершенииРедактированияФормулы(ОписаниеФормулы, ДополнительныеПараметры) Экспорт

	Если ОписаниеФормулы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеФормулы.Формула = СтрЗаменить(ОписаниеФормулы.Формула, "СтрокаДокументаРезерв_", "СтрокаДокументаРезерв.");
	Объект.Алгоритм = "РасчетноеЗначение = " + ОписаниеФормулы.Формула;
	//ПредставлениеФормулы = ОписаниеФормулы.ПредставлениеФормулы;
	
	Модифицированность = Истина;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
